package com.example.firstaidapp;

import androidx.appcompat.app.AppCompatActivity;
import androidx.core.app.NotificationCompat;
import androidx.core.app.NotificationManagerCompat;

import android.app.NotificationChannel;
import android.app.NotificationManager;
import android.content.Intent;
import android.os.Build;
import android.os.Bundle;
import android.text.method.ScrollingMovementMethod;
import android.view.Menu;
import android.view.MenuInflater;
import android.view.MenuItem;
import android.widget.ImageView;
import android.widget.ScrollView;
import android.widget.TextView;
import android.widget.Toast;

public class Info extends AppCompatActivity {

    TextView title, description;
    ImageView photo;
    String data1;

    private final String CHANNEL_ID="personal_notifications";
    private final int NOTIFICATION_ID=001;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_info);

        title = (TextView) findViewById(R.id.title);
        description=(TextView) findViewById(R.id.description);
        photo=(ImageView) findViewById(R.id.photo);

        getSupportActionBar().setTitle("Прва Помош");
        getSupportActionBar().setDisplayHomeAsUpEnabled(true);

        getData();

        if (Build.VERSION.SDK_INT >= Build.VERSION_CODES.O) {
            NotificationChannel channel=new NotificationChannel(CHANNEL_ID,"My Notification", NotificationManager.IMPORTANCE_DEFAULT);
            NotificationManager manager=getSystemService(NotificationManager.class);
            manager.createNotificationChannel(channel);
        }
    }

    @Override
    public boolean onCreateOptionsMenu(Menu menu) {
        MenuInflater inflater = getMenuInflater();
        inflater.inflate(R.menu.mymenu, menu);
        return super.onCreateOptionsMenu(menu);
    }

    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        int id = item.getItemId();
        if (id == android.R.id.home) {
            finish();
        }
        return super.onOptionsItemSelected(item);
    }

    private void getData() {
        Intent intent=getIntent();
        String str=intent.getStringExtra("data1");
        switch (str) {
            case ("Ампутација"):
                title.setText("Ампутација");
                description.setText("1.\tСпречете го губитокот на крв со директен притисок на раната и попдигање на повредениот дел од телото.\n" +
                        "2.\tНа раната ставете стерилна газа или компреа и замотајте со завој. Применете мерки против шок.\n" +
                        "3.\tПовикајте ИМП. Следете ги виталните знаци\n" +
                        "4.\tЗамотајте го повредениот, откинат дел од телото во кеса, фолија, газа или ткаенина.\n" +
                        "5.\tСтавете го во пластича кесичка, заврзете го и ставете ја во сад или друга кеса исполнета со мраз.\n" +
                        "6.\tЗапишете го времето на настанување на повредата, името и презимето на повредениот и истата предадете ја на службата за ИМП.\n");
                photo.setImageResource(R.drawable.amputacija);
            break;
            case ("Внатрешно крварење"):
                title.setText("Внатрешно крварење");
                description.setText("Препознавање:\n" +
                        "\t- На почеток бледа, ладна, влажна кожа, акокрварењето е подолготрајно тогаш кожата станува цијанотична.\n" +
                        "\t- Брз, слаб пулс.\n" +
                        "\t- Жед. \n" +
                        "\t- Збунетост, вознемиреност, раздразливост.\n" +
                        "\t- Можен е губиток на свест.\n" +
                        "\t- Крварење од телесните отвори.\n" +
                        "\t- Болка.\n" +
                        "Прва помош - се применуваат истите постапки како кај шок.\n");
                photo.setImageResource(R.drawable.vkrvarenje);
                break;
            case ("Задушување со страно \n тело (возрасен)"):
                title.setText("Задушување со страно тело (возрасен)");
                description.setText("1. Поттикнете го лицето кое се гуши да кашла и со тоа да ја отстрани причината за задушување.\n" +
                        "2. Ако не успее тоа, навалете го на напред и удрете го силно со 5 пати на грбот помеѓу лопатките со долниот дел на дланката.\n" +
                        "3. Ако гушењето продолжува применете 5 притискањана стомакот на тој начин пто ќе застанете зад повредениот. Ќе го опфатите со рацете така што, едната дланка ќе ја поставите помеѓу папокот и долниот раб на градната коска. Опфатете го со другата дланка и втиснете ја силно кон внатре и нагоре до 5 пати. Проверете ја устата повторно.\n" +
                        "4. Повторете го вториот и третиот чекор до три циклуци и ако не успеете повикајте ИМП. Продолжете со постапките се до придтигнување на помошта.\n");
                photo.setImageResource(R.drawable.zadushuvanje);
            break;
            case ("Задушување со страно \n тело (дете)"):
                title.setText("Задушување со страно тело (дете)");
                description.setText("1. Применте 5 удари по грбот. Доенчето наведнете го надолу со лицето потпирајќи ги телото и главата на вашата подлактица.\n" +
                        "2. Свртете го бебето со лицето кон вас и потпрете му го грбот и главата. Прегледајте му ја устата. Извадетеги страните тели кои се причина за гушење.\n" +
                        "3. Ако гушењето продолжи, ставете ги двата прста на долната половина на градната коска и применете 5 силни притисоци, туркајќи ги прстите кон внатре и кон главата. Повторно проверете ја устата.\n" +
                        "4. Ако после 3 циклуси (повторувајќи ги чекорите 2 и 3) гушењето продолжи, повикајте ИМП. Продолжете со постапките се до пристигнување на помошта.\n");
                photo.setImageResource(R.drawable.zadushuvanje);
             break;
            case ("Исчашување"):
                title.setText("Исчашување");
                description.setText("1.\tПостави го повредениот во положба мирување – да му е удобно.\n" +
                        "2.\tПодигни ги естремитетите на повредениот за да се намали отокот.\n" +
                        "3.\tПостави ладни облоги за да се намалат отокот и болката.\n" +
                        "4.\tНаправи имобилизација.\n");
                photo.setImageResource(R.drawable.ischashuvajne);
                break;
            case ("Механичка повреда"):
                title.setText("Механичка повреда");
                description.setText("1.\tСтавете стерилни ракавици и целата рана покријте ја со стерила газа.\n" +
                        "2.\tПреврзете ја раната со завој или со триаголна марама, или едноставно фиксирајте ја газата со фластер.\n" +
                        "3.\tВнимавајте газатада не се изместува од раната.\n" +
                        "4.\tДоколку раната се наоѓа на ектремитетите, подигнете ги над нивото на срцето за да се намали крварењето и имобилизирајте ги .\n");
                photo.setImageResource(R.drawable.mehanichka);
                break;
            case ("Мозочен удар"):
                title.setText("Мозочен удар");
                description.setText("1.\tСмирете го повредениот и повикајте ИМП или замолете некој друг да повика.\n" +
                        "2.\tВнимавајте лицето да мирува и да не се напрега. Поставете го лицето во удобна лежечка положба со подигнати рамена и глава.\n" +
                        "3.\tПогрижете се лицето да има доволно свеж воздух.\n" +
                        "4.\tРазлабавете ја тесната облека.\n" +
                        "5.\tСледете ги виталните функции – свест дишење додека ќекате ИМП и доколку е потребно применете веднаш СБО.\n");
                photo.setImageResource(R.drawable.mozochen);
                break;
            case ("Нагмечување"):
                title.setText("Нагмечување");
                description.setText("1.\tПостави го повредениот во положба на мирување – да му е удобно.\n" +
                        "2.\tПодигни ги екстремитетите на повредениот за да се намали токот.\n" +
                        "3.\tПостави ладни облоги за да се намалат отокот и болката.\n");
                photo.setImageResource(R.drawable.nagmechuvanje);
                break;
            case ("Надворешно крварење \n (општо)"):
                title.setText("Надворешно крварење (општо)");
                description.setText("1. Соблечете ја облеката или скинете ја за да ја откриете раната.\n" +
                        "2. На раната ставете стерилна газа или компресивен завој и притиснете ја со прсти. Притискајтена раната за да го запрете крварењето.\n" +
                        "3. Подигнете го повредениот екстреитет за да го намалите крварењето.\n" +
                        "4. Помогнете му на повредениот да легне. Бидејќи е можна појава на шок, подигнете ги двете нозе на повредениот.\n" +
                        "5. За да го одржите притисокот, цврсто замотајте ја раната со завој. При замотување, не ја престегајте преврската за да не дојде до сопирање а крванта циркулација. Ако забележите дека се појавила крв на газата, преку неа ставете друга.\n" +
                        "6. Проверувајте ја циркулацијата на секои 10 минути.\n" +
                        "7. Ако циркулацијата е загрозена, разлабавете ја преврската.\n" +
                        "8. Повикајте ИМП и следете ги виталните знаци до нејзиното пристигнување.\n");
                photo.setImageResource(R.drawable.nadvoreshnoko);
                break;
            case ("Надворешно крварење \n (нос)"):
                title.setText("Надворешно крварење (нос)");
                description.setText("1. Поставете го повредениот во седната пположба и со наведната глава за да може крвта да истекува низ носниците.\n" +
                        "2. Притиснете на мекиот дел на носот и држете 10 минути. Смирете го повредениот и помогнете му ако е потребно.\n" +
                        "3. По 10 минути, проверете дали крварењето сопрело.\n" +
                        "4. Ако не сопрело, кажете му на повредениот повторно да го притисне носот два пати по 10 минути.\n" +
                        "5. Откако ќе престане крварењето, повредениот се уште нека биде наведнат, а вие избришете го местото околу носот со млака вода.\n" +
                        "6. Советувајте го да мирува неколку часа и да избегнува напрегање.\n" +
                        "7. Ако крварењто престане и повторно се појави по извесно време, помогнете му на повредениот да го повтори притисокот на носот.\n" +
                        "8. Ако крварењето е силно или долготрајно повеќе од 30 минути, помогнете му на повредениот да стигне до болница.\n");
                photo.setImageResource(R.drawable.nosk);
                break;
            case ("Надворешно крварење \n (уво)"):
                title.setText("Надворешно крварење (уво)");
                description.setText("1. Помогнете му на повредениот да се смести во полуседната положба со главата навалена кон повредената страна за да истекува крвта.\n" +
                        "2. Држете на увото стерилна газа или компреса.\n" +
                        "3. Не го затварајте увото.\n" +
                        "4. Повредениот однесете го во болница.\n");
                photo.setImageResource(R.drawable.uvok);
                break;
            case ("Пригмеченост"):
                title.setText("Пригмеченост");
                description.setText("1.\tАко знаете дека повредениот е пригмечен помалку од 15 минути ослободете го од таа положба.\n" +
                        "2.\tСопрете го надворешното крварење, имобилизирајте и внимавајте на појава на шок.\n" +
                        "3.\tАко повредениот е пригмечен повеќе од 15 минути или ако причината за пригмечувањето не можете да ја отстраните оставете го повредениот во положбата во која сте го затекнале и пружете му психолошка поддршка.\n" +
                        "4.\tПовикајте ИМП.\n" +
                        "5.\tСледете ги виталните знаци до пристигнување на ИМП.\n");
                photo.setImageResource(R.drawable.nagmechuvanje);
                break;
            case ("Рбетна повреда"):
                title.setText("Рбетна повреда");
                description.setText("1.\tКлекнете позади главата на повредениот. Лактите фиксирајте ги на земја, а со рацете фатете ја главата на повредениот. Придржувајте ја главата во неутрална положба со што главата, вратот и кичмата треба да се во иста линија.\n" +
                        "2.\tОтворете го дишниот пат внимателно без да го поместите вратот на повредениот.\n" +
                        "3.\tПроверете дали повредениот диши. Доколку диши, придржувајте ја главата во неутрана положба и повикај ИМП (ова нека го стори некој од околина).\n" +
                        "4.\tДоколку не диши, дајте вештачко дишење.\n" +
                        "5.\tДоколку треба да ја свртите жртвата на грб, користете ја Log-roll техниката.\n" +
                        "6.\tРедовно проверувајте ги виталните знаци – степеот на свесност, дишење и пулс.\n");
                photo.setImageResource(R.drawable.rbetnap);
                break;
            case ("Скршеница \n (отворена)"):
                title.setText("Скршеница (отворена)");
                description.setText("1.\tПрекријте ја раната со стерилна газа. Притиснете околу повредата за да го контролирате крварењето, но внимавајте да не притиснете директно на скршената коска.\n" +
                        "2.\tПоставете гази на, и околу скршеницата.\n" +
                        "3.\tПреврзете со завој, но внимателно. Преврската треба да биде лабава за да е дојде до сопирање на циркулацијата.\n" +
                        "4.\tОрганизирајте транспорт на повредениот. Поставете ѓеврече обиколувајќи го страното тело кое треба да е доволно високо, да кога ќе се постави завој преку него не го притиска страното тело.\n" +
                        "5.\tСледете ги виталните функции до пристигнувањето на екипата на ИМП. Проверувајте ја циркулацијата под местото на преврска на секои 10 минути. Ако истата е нарушена, разлабавете го завојот, одмотајте и повторно замотајте го.\n");
                photo.setImageResource(R.drawable.skrshenicao);
                break;
            case ("Скршеница \n (клучна коска)"):
                title.setText("Скршеница (клучна коска)");
                description.setText("1.\tПрвата триаголна марама завиткајте ја како повеќеслоен завој и поставете ја на задната страна на вратот на повредениот со средниот дел.\n" +
                        "2.\tПотоа, поставете ја под пазувите од предната страна кон назад на грбот и подврзете ја.\n" +
                        "3.\tПод пазувите ставете мека ткаенина со што се попречува притисокот од триаголната марама врз кожата и крвните садови.\n" +
                        "4.\tВтората тиаглна марама, исто така завиткајте ја како повеќеслоен завој и поставете ја на грбот на повредениот. Таа служи за затегнување на првата марама.\n" +
                        "5.\tПо поставувањето на имобиизацијата проверете го пулсот на артеријата кај коренот на дланката.\n");
                photo.setImageResource(R.drawable.skrshenicakk);
                break;
            case ("Скршеница \n (подлактица)"):
                title.setText("Скршеница (подлактица)");
                description.setText("1.\tЕдната триаголна марама поставете ја под подлактицата пред градниот кош.\n" +
                        "2.\tМарамата се поставува надолжно со основата на марамата во средината на телото, а врвот од марамата е свртен кон лактот на повредената рака. \n" +
                        "3.\tДругите два краја од марамата се врзуваат околу вратот.\n" +
                        "4.\tЕдниот врв ја прекрива повредената рака, а другиот оди директно до вратот.\n" +
                        "5.\tВрвот од марамата свртен кон лактот на повредената рака завиткајте го и фиксирајте го околу лактот.\n" +
                        "6.\tДругата триаголна марама завиткајте ја како повеќеслоен завој и поставете ј ахризонатлно околу првата марама, непосредно над подлактицата. Таа служи иза фиксирање на првата марама.\n");
                photo.setImageResource(R.drawable.skrshenicap);
                break;
            case ("Скршеница \n (карлица)"):
                title.setText("Скршеница (карлица)");
                description.setText("1.\tСместете го повредениот на грб.\n" +
                        "2.\tСмирете го и бодрете го повредениот.\n" +
                        "3.\tДржете ги озете исправено и помогнете му на повредениот да ги свитка лесно нозете во колената поставувајќи мека ткаенина пон нив и меѓу нозете.\n" +
                        "4.\tНаправете имобилизација на нозете со триаглести марами од кои ената се прекрстува во областа на стапалата, а втората а колената.\n" +
                        "5.\tНе го преместувајте повредениот беспотребно. Чекајте да пристигне ИМП.\n" +
                        "6.\tСледете ги виталните функции.\n");
                photo.setImageResource(R.drawable.skrshenicakar);
                break;
            case ("Скршеница \n (натколеница)"):
                title.setText("Скршеница (натколеница)");
                description.setText("1.\tПовредениот лежи на грб.\n" +
                        "2.\tЕдното лице ја истегнува повредената нога, а другто лице ја изведува имобилизацијата.\n" +
                        "3.\tТриаголните марами се завиткуваат како повеќеслоен завој и се поставуваат под телото и под повредената нога на следниот начин:\n" +
                        "- Првата марама се поставува под долната половина на градниот кош.\n" +
                        "- Втората марама се поставува под стомакот.\n" +
                        "- Третата марама се поставува под карлицата.\n" +
                        "- Четвртата и петтата марама се поставуваат под натколеницата над и под скршеицата.\n" +
                        "- Шестата марама се поставува под средината на подколеницата.\n" +
                        "- Седмата марама се поставува под скочниот зглоб.\n" +
                        "4.\tПодолгата штица се поставува над рашираните марами до нагата на повредениот од надворешната страна, почнувајќи од пазивата па до стапалото.\n" +
                        "5.\tПократката штица се поставува над рашрените марами од внатрешната страна на повредената нога по целата должина на ногата.\n" +
                        "6.\tМарамите се заврзуваат околу штиците, телото и поврдениот екстремитет.\n");
                photo.setImageResource(R.drawable.skrshenicank);
                break;
            case ("Скршеница \n (потколеница)"):
                title.setText("Скршеница (потколеница)");
                description.setText("1.\tЗавиткајте ги триаголните марами икако повеќеслоен завој и пставете ги под повредената нога.\n" +
                        "2.\tПрвата марама поставете ја над коленото, а последната над скочниот зглоб.\n" +
                        "3.\tПоставете ги штиците над раширените марами од двете страни на повредената потколеница. Штците треба да ги опфатат деловите над коленото (од средината на бутната коска), па до стапалото.\n" +
                        "4.\tМарамите заврзете ги околу штиците и потколеницата.\n" +
                        "5.\tИмобилизацијата нога со нога се изведува тогаш кога нема штици.\n" +
                        "6.\tСо триаголните марами опфатете ги двете коленици.\n" +
                        "Првата марама поставете ја над коленото, а последнатанад скочниот зглоб, вкрстена околу стапалата.\n");
                photo.setImageResource(R.drawable.skrshenicapk);
                break;
            case ("Срцево-белодробно \n оживување (возрасен)"):
                title.setText("Срцево-белодробно оживување (возрасен)");
                description.setText("•\tДоколку повредениот е без свест и не диши нормално, започнете со надворешна срцева масажа\n" +
                        "1.\tКлекнете покрај градниот кош на повредениот.\n" +
                        "2.\tСтавете го коренот (мекиот дел) од дланката на средина на градната коска на повредениот.\n" +
                        "3.\tНад таа рака поставете го коренот на дланката од другата рака. Преплетете ги прстите на двете дланки.\n" +
                        "4.\tИсправете ги двете раце во лактите и немојте да ги витката за време на надворешното притискање на срцето. Градната коска притискајте ја за 5-6 сантиметри, со фреквенција од 100 притискања/минута.\n" +
                        "5.\tПо секое притискање ослободете го притисокот, со што се овозможува градниот кош на повредениот пасивно да се врати во првобитната положба. Вашите дланки остануваат на градите на повредениот. Времетраењето на притискањето на градната коска и ослободувањето на притисокот треба да биде еднакво. Прекините на надворешното притискање на срцето треба да траат што е можно пократко.\n" +
                        "•\tИзведувајте 30 надворешни притискања на срцето. Продолжете со две вештачки дишења.\n" +
                        "1.\tОтворете го дишниот пат на повредениот со зафрлање на главата кон назад и со подигање на брадата. Едната рака поставете ја на челото на повредениот. Со палецот и показалецот затворете го носот на повредениот. Со другата рака подигнете ја брадата така што устата да биде отворена.\n" +
                        "2.\tВдишете нормално и со својата уста опфатете ја устата на повредениот. Внимавајте контактот да биде добар.\n" +
                        "3.\tПолека издишете рамномерно во устата на повредениот и гледајте дали градниот кош се подига во траење од 1 секунда.\n" +
                        "4.\tДржете ја главата на повредениот зафрлена и продолжете да ја придржувате брадата. Одалечете ја устата од устата на повредениот и набљудувајте го спштањето на градниот кош додека воздухот излегува при издишувањето.\n" +
                        "5.\tНормално вдишете и дајте уште едно вештачко дишење.\n" +
                        "•\tПродолжете со надворешна масажа на срцето и вештачко дишење во однос 30:2!\n" +
                        "•\tПродолжете со оживувањето се додека:\n" +
                        "-\tНе дојде медицинскиот тим од ИМП.\n" +
                        "-\tДодека повредениот започне да диши нормално.\n" +
                        "-\tДодека физички не се заморите.\n" +
                        "•\tАко повредениот почне да диши, а е без свест, поставете го во странична положба!\n");
                photo.setImageResource(R.drawable.cprv);
                break;
            case ("Срцево-белодробно \n оживување (дете)"):
                title.setText("Срцево-белодробно оживување (дете)");
                description.setText("1.\tОтворете го дишниот пат а повреденото со зафрлање на главата кон назад и со подигање на брадата. Едната рака поставете ја на челото на детето.Со палецот и показалецот затворете го носто на детето. Со другата рака подигнете ј абрадата, така што устата да биде отворена.\n" +
                        "2.\tВдишете нормално и со своите усни опфатете ја устата на детето така то да не излегува воздух. Издишете го воздухот во устата на детето за една секунда. Градниот кош треба да се подигне. Ако тој не се подига можеби е потребно да ја наместите главата поубаво. Применете 5 почетни вештачки дишења по методата уста на уста.\n" +
                        "3.\tПродолжете со притискање на градниот кош.\n" +
                        "- Надворешното притискање на срцето кај децата се изведува со коренот на едната дланка во средината на долната половина на градната коска.\n" +
                        "- Градната коска треба да се притисне за околу една третина со фреквенција 100 притискања во минута. \n" +
                        "Применете 30 притискања на градниот кош.\n" +
                        "4.\tВратете се кон главата на детето, отворете го дишниот пат и продолжете со 2 вдувувања во траење од 1 секунда. Проверете дали се подига градниот кош.\n" +
                        "5.\tПродолжете со надворешна масажа на срцето и вештаќко дишење во однос 30:2!\n");
                photo.setImageResource(R.drawable.cprd);
                break;
            case ("Срцево-белодробно \n оживување (бебе)"):
                title.setText("Срцево-белодробно оживување (бебе)");
                description.setText("1.\tПоставете го бебето пред себе, на рамна површина во висина на вашата половина или на под. Отворете го дишниот пат на повреденото со зафрлање а главата кон назад и со подигање на брадата. Едната рака поставете ја на челото на бебето, а со другата рака подигнете ја брадата така што устата да биде отворена.\n" +
                        "2.\tВдишете нормално, а потоа со вашите усни опфатете ги устата и носот на бебето и издишете. Доколку не можете да постигнете херметилност, затворете го само носот на бебето. Издишете го воздухот во устата на бебето и градниот кош на бебето треба да се подигне.\n" +
                        "3.\tВнимавајќи главата на бебето да биде зафрлена, а брадата подигната, насочете ја вашата глава кон градниот кош за да видите дали се спушта градниот кош. Ако градниот кош се подига додека му давате вештачко дишење и спушта кога ќе се оттргнете од устата, тогаш правилно сте дале вештачко дишење. Применете 5 почетни вештачки дишења!\n" +
                        "4.\tПродолжете со притискања на градниот кош.\n" +
                        "- Надворешното притискање на срцето кај бебињата се изведува со јагодиците на показалецот и средниот прст на градната коска, еден попречен прст над замислената линија која што ги поврзува брадавиците.\n" +
                        "- Притиснете ја градната коска со длабочина за околу една третина на градниот кош, и со фреквенција од 100 притискања в минута. Применете 30 притискања на градниот кош.\n" +
                        "5.\tВратете се кон главата на бебето и продолжете со 2 вдувувања во траење од  1 секунда. Проверете дали се подига градниот кош.\n");
                photo.setImageResource(R.drawable.cprb);
                break;
            case ("Срцев удар"):
                title.setText("Срцев удар");
                description.setText("1.\tСмирете го повредениот и повикајте ИМП или замолете некој друг да повика.\n" +
                        "2.\tВнимавајте повредениот да мирува и да не се напрега. Поставете го повредениот во удобна положба (полуседната или седната). За да го намалите срцевиот напор. Потпрете ја главата и рамената и свиткајте ги колената. Поставете ќебе или перница под колената.\n" +
                        "3.\tПогрижете се повреденит да има доволно свеж воздух.\n" +
                        "4.\tРазлабавете ја тесната облека.\n" +
                        "5.\tСледете ги виталните функции додека чекате ИМП и доколку е потребно применете СБО.\n");
                photo.setImageResource(R.drawable.srcevu);
                break;
            case ("Страно тело во рана"):
                title.setText("Страно тело во рана");
                description.setText("1.\tЗапрете го крварењето притискајќи цврсто од едната и другата страна на страното тело. Немојте да притискате на страното тело, ниту да го отстранувате.\n" +
                        "2.\tПодигнете го повредениот дел од телото.\n" +
                        "3.\tОд едната и другата страна на страното тело поставете гази. Со газа покријте ја и раната и страното тело.\n" +
                        "4.\tПоставете ѓевреле, обиколувајќи го страното тело. Ѓевречето треба да е доволно високо така што кога ќе се постави завој преку него, завјот не смее да притиска на страното тело.\n" +
                        "5.\tЗамотајте со завој, опфаќајќи ги рабовите на ѓевречето. Внимавајте на циркулацијата. Ако истата е нарушена, разлабавете го завојот, одмотајте и повторно замотајте го.\n" +
                        "6.\tПогрижете се за повредениот во случај на појава на шок.\n" +
                        "7.\tПовикајте ИМП.\n" +
                        "Следете ги виталните функции до пристигнувањето на екипата на ИМП. \n");
                photo.setImageResource(R.drawable.stranotelo);
                break;
            case ("Температурна повреда \n (изгореница)"):
                title.setText("Температурна повреда (изгореница)");
                description.setText("1.\tПреземете мерки за обезбедување на местото.\n" +
                        "2.\tИзгасете ја облеката доколку гори.\n" +
                        "3.\tСмирете го и охрабрувајте го повредениот.\n" +
                        "4.\t Отстранете го накитот (прстени, нараквици, рачен часовник) што порано, додекаизгорениот дел не отекол.\n" +
                        "5.\tОладете ја изгореницата (налевајте ладна вода на изгореницата најмалку 10 минути).\n" +
                        "6.\tПо ладењето направете преврска:\n" +
                        "- Поставете газа или газа за изгореници на местото на изгореницата.\n" +
                        "- Преврзете ја изгорената површина сосема лабаво со стерилен завој.\n" +
                        "- Направете имобилизација на изгорениот дел за да е намалат болката и ширењето на инфекциите.\n" +
                        "7.\tПовредениот поставете го во лежечка положба, а ако се изгорени и дишните патишта – во седечка положба. Со мирување или имобилизација на изгорениот дел ја намалувате болката и ширењето на инфекција.\n" +
                        "8.\tПовикајте ИМП или советувајте го повредениот да побара лекарска помош.\n" +
                        "9.\tЗаштитете го повредениот од студ или топлина.\n" +
                        "10.\tУблажнете ја жедта со влажнење на усните на повредениот.\n" +
                        "11.\tТретирајте за шок – набљудувајте ги виталните знаци – свест, пулс, дишење.\n");
                photo.setImageResource(R.drawable.izgorenica);
                break;
            case ("Температурна повреда \n (смрзнатина)"):
                title.setText("Температурна повреда (смрзнатина)");
                description.setText("1.\tСмирете го и охрабрувајте го лицето.\n" +
                        "2.\tСместете го на топло.\n" +
                        "3.\tПоставете го во удобна лежечка положба.\n" +
                        "4.\tОтстранете ја мократа облека, обувки и накит од повреденото место.\n" +
                        "5.\tПокријте ја смрзнатината со стерилен материјал и лесно завиткајте ја без стегање. Внимание! Не смеете да ја триете смрзнатината, да ги пукнете меурите, да ставате разни средства и директно да ја загревате раната.\n" +
                        "6.\tПовредениот дел од телото ставете го во мирување или имобилизирајте го со цел да се намали болката и ширењето на инфекции.\n" +
                        "7.\tЗатоплете го лицето и постепено загревајте го целото тело.\n" +
                        "8.\tТретирајте за шок.\n" +
                        "9.\tПовикајте ИМП.\n" +
                        "10.\tОстанете покрај лицето и следете ги виталните функции додека ја чекате ИМП. Во случај на влошување на состојбата, применете прва помош.\n");
                photo.setImageResource(R.drawable.smrznatina);
                break;
            case ("Шинување"):
                title.setText("Шинување");
                description.setText("1.\tПостави го повредениот во положба на мирување – да му е удобно.\n" +
                        "2.\tПодигни ги екстремитетите на повредениот за да се намали отокот.\n" +
                        "3.\tПостави ладни облоги за да се намалат отокот и болката.\n" +
                        "4.\tНаправи имобилизација.\n");
                photo.setImageResource(R.drawable.nagmechuvanje);
                break;
            case ("Шок"):
                title.setText("Шок");
                description.setText("Препознавање \n" +
                        "1.\tНа почетокот:\n" +
                        "- Бледа и студена кожа, оросена со леплива пот\n" +
                        "- Забрзан пулс поради забрзана работа на срцето \n" +
                        "2.\tКако се развива шокот:\n" +
                        "- Крајните делови на телото (врвовите од прстите, усните, ушната ресичка) добиваат темносина боја. Доколку се притисе ноктот или ушната ресичка нема веднаш да се врати првобитната боја.\n" +
                        "- Општа слабост, малаксаност.\n" +
                        "- Површно, забрзано, неправило дишење.\n" +
                        "- Мачнина, гадење, нагон за повраќање.\n" +
                        "- Жед.\n" +
                        "- Слаб опиплив пулс.\n" +
                        "- Вртоглавица, слабост.\n" +
                        "3.\tСо намалување на снабдувањето со кислород на мозокот:\n" +
                        "- Повредениот кој на почетокот е возбуден, нервозен и уплашен дури и на мменти агресивен, постепено станува незаинтересиран, мирен,апатичен (не се жали на болки и покрај значајните повреди на неговото тело).\n" +
                        "- Проѕевање, неправилно дишење, повреденит почнува да се бори за воздух.\n" +
                        "- Губење на свеста (бессознание).\n" +
                        "4.\tПрестанок на дишењето и работата на срцето.\n" +
                        "ВНИМАНИЕ\n" +
                        "- Не му давајте на повредениот да јаде, пие, пуши или да се движи. Доколку се жали на силна жед, навлажнете ги неговите усни со газа натопена со вода.\n" +
                        "- Не го оставајте повредениот, освен кога треба да повикате помош.\n" +
                        "- Ако повредениот изгуби свест, отворете го дишниотпат и проверете го дишењето.\n" +
                        "Мерки:\n" +
                        "1.\tТретирајте ги приините кои довеле или можат да доведат до шок (на пример сопирање на обилното крварење, третман на изгорениците, итн.)\n" +
                        "2.\tЛегнете го повредениот на грб (доколку е можно поставете изолација од студената подлога).\n" +
                        "3.\tПостојано комуницирајте со повредениот, давајте му психолошка поддршка.\n" +
                        "4.\tПоставете го повредениот во шок – положба. Подигнете ги и нозете на повредениот над висината на срцето, со цел да се пренасочи крвта кон виталните органи. Внимавајте а можни затворени скршеници на нозете. Доколку постои пповреда на градниот кош, повредениот се поставува во полуседната положба.\n" +
                        "5.\tОлабавете ја тесната облека (особено околу вратот и градите) и одржувајте ја топлината на телото (покријте го).\n" +
                        "6.\tПовикајте Итна Медицинска Помош (194).\n" +
                        "7.\tПродолжете да ги следите виталните знаци. Бидете подготвени за срцево – белодробно оживувње доколку повредениот западне во бессознание и престане да дише.\n");
                photo.setImageResource(R.drawable.shok);
                break;
        }
        description.setMovementMethod(new ScrollingMovementMethod());
    }

    public void car(MenuItem item) {
        Intent intent=new Intent(Info.this,CarSafety.class);
        Info.this.startActivity(intent);
    }

    public void phone(MenuItem item) {
        NotificationCompat.Builder builder=new NotificationCompat.Builder(Info.this,CHANNEL_ID);
        builder.setContentTitle("Важни броеви");
        builder.setContentText("Брза помош - 194 Полиција - 192 Пожарна - 193");
        builder.setSmallIcon(R.drawable.ic_baseline_notification);
        builder.setAutoCancel(true);
        builder.setPriority(NotificationCompat.PRIORITY_DEFAULT);
        builder.setVisibility(NotificationCompat.VISIBILITY_PUBLIC);

        NotificationManagerCompat managerCompat=NotificationManagerCompat.from(Info.this);
        managerCompat.notify(NOTIFICATION_ID,builder.build());
    }
}